[{
    "q": "能否简单概括下Loopring协议？",
    "a": "Loopring是一个开放的，基于ERC20和智能合约的代币间多边交易协议。通过该协议，可以建立去中心化且无需资产托管和资金冻结的交易所应用。"
}, {
    "q": "​​我能基于Loopring自己做交易所吗，收入可能有哪些？",
    "a": "Loopring是个开放的协议，而不是一家交易所。协议允许任何人参与交易的撮合。Loopring交易所的撮合服务收入分两部分：交易手续费和订单环路的“成本节约分润”。其中“成本节约分润”为主要收入来源，这样做的目的是为了激励撮合价格最优订单。如果交易所支持代币发行业务（比如支持链外资产到指定区块链的代币发行，或者跨链代币发行），也可以收取相关的服务费。不过代币发行业务相对独立，和Loopring关系不大。"
}, {
    "q": "Loopring协议是不是只在以太坊（ETH）上开发？",
    "a": "Loopring协议需要1）类似ERC20的代币API机制和2）区块链智能合约支持。考虑到以太坊（Ethereum，ETH）的成熟和普及程度，我们选择ETH作为我们第一个开发Loopring协议的区块链平台。然而Loopring协议并不是为ETH量身定做的，它可以在满足条件的多条异构区块链上得以实施。我们后续考虑在ETC，量子链，Hyperledger（如果支持ERC20），及ChinaLedger社区版上开发Loopring协议。"
}, {
    "q": "Loopring协议会发行自己的代币吗？",
    "a": "Loopring协议会在相应的底层区块链上发行符合ERC20规范的原生代币。在ETH上代币的其符号为MTC。MTC在协议中有着重要的作用，包括交易手续费的支付、交易所抵押，和去中心化自治等。"
}, {
    "q": "Loopring交易所比中心化交易所更安全吗？",
    "a": "Loopring设计目标之一是解决中心化交易所固有的安全风险。使用Loopring交易所，用户的资产不会被交易所托管，也不会被订单冻结，交易过程和清算支付在一个智能合约中通过原子操作完成（或失败）。因此使用Loopring交易所买卖代币理论上资产丢失的可能性为零，内幕交易风险为零。"
}, {
    "q": "Loopring交易机制允许交易所和做市商套利吗？",
    "a": "Loopring协议不禁止套利行为。套利行为也是为其他用户提供流动性的行为，也是在做市，对交易促成有利。但Loopring协议禁止任何人无风险套利，比如说通过上传包含子环的交易环路进行无风险套利。具体可以参考我们的白皮书。"

}, {
    "q": "Loopring支持市价单吗？",
    "a": "目前版本的Loopring协议暂不支持市价单（Market Price order)，原因是市价单成交需要对手单下单时间被系统强一致排序，由于Loopring是去中心化的，并且订单表不放如区块链，订单无法按照时间严格排序。"
}, {
    "q": "如何防止提交到区块链的交易环路被被窃取？",
    "a": "Loopring协议有机制防止交易环路窃取行为。交易所在上传订单环路前，可以先上传订单环路的哈希值作为存证。当存证被写入区块链后，再上传订单环路信息。拥有存证的订单环路具有更高的优先级成交。Loopring协议不要求订单环路一定要在区块链上具有存证。"
}, {
    "q": "如何防止提交到区块链的交易环路被被窃取？",
    "a": "Loopring协议有机制防止交易环路窃取行为。交易所在上传订单环路前，可以先上传订单环路的哈希值作为存证。当存证被写入区块链后，再上传订单环路信息。拥有存证的订单环路具有更高的优先级成交。Loopring协议不要求订单环路一定要在区块链上具有存证。"
}, {
    "q": "Loopring是否允许订单被部分撮合，撮合后有可能被取消或回滚吗？",
    "a": "订单是可以部分撮合的，而且可以由多家交易所联合完成。订单环路及费用收取是作为同一笔交易写入区块链，具有事务的原子性，不会部分执行。成交一单被智能合约确认，不会回滚（除非区块链本身重组）。"
}, {
    "q": "能否解释下为什么一个订单可以被提交给多家交易所？",
    "a": "Loopring协议下，订单其实是一些指令而非资产（因为没有充值提现过程，也没有抵押和锁定），这些指令当然可以被多家交易所知晓，并且通过区块链智能合约去部分或者全部执行。由于Loopring订单中的资产是在区块链上用户自己的地址中持有，因此可以被多家交易所通过智能合约做撮合后的清结算。这是Loopring协议的巨大优势之一。"
}, {
    "q": "你们什么时候开始ICO？",
    "a": "我们正在做概念性证明的开发和ICO细节的探讨。我们欢迎社区和我们交流互动。如果您有兴趣加入我们的基金会，或部分时间贡献力量，或想参加我们的ICO，请联系 foundation@loopring.io 。"
}]
